{
    "main": {
        "name": "Edwin Zhang",
        "bio": "My degree in computer engineering specializes in software development. Additionally I love 'next-gen' technology so I also plan on minoring in Artificial Intellegience and Machine Learning. I have experience working with C++, Python and Javascript which you can find out more in detail down below or download a condensed version in my resume!",
        "social": [{
                "name": "email",
                "url": "mailto:Edwin.Zhang28@gmail.com",
                "className": "fa fa-envelope"
            },
            {
                "name": "linkedin",
                "url": "https://www.linkedin.com/in/edwin-zhang-634734183/",
                "className": "fa fa-linkedin"
            },
            {
                "name": "instagram",
                "url": "https://www.instagram.com/edwinz_28/",
                "className": "fa fa-instagram"
            },
            {
                "name": "github",
                "url": "https://github.com/Edwinz28",
                "className": "fa fa-github"
            }
        ]
    },
    "resume": {
        "education": [{
            "school": "University of Toronto St. George",
            "degree": "Candidate for Bachelors in Computer Engineering",
            "graduated": "April 2022",
            "description": "I had a wonderful experience at my school so far! My learning has been diverse from learning about circuits to analog/digital electronics, computer hardware, and my favourite: software development. I am currently focusing on my degree by taking more software development related courses and expanding to AI's and machine learning"
        }],
        "work": [{
                "company": "Major Tonic",
                "title": "Full Stack Developer",
                "years": "June 2010 - September 2020",
                "description": "Major Tonic is a Toronto based clothing startup looking to enter the fashion industry. My role on the team is to develop their online platform in form of a website to advertise and sell their products to their customers. I used react to turn their design of a website into reality as well as using MongoDB Atlas and NodeJS to create a drop shipping inventory system. I've implemented their payment system as well as their user management system."
            },
            {
                "company": "StatsDrone",
                "title": "Research and Design Engineer",
                "years": "January 2019 - April 2019",
                "description": "StatsDrone offers a software to affiliate marketers that assists in amalgamating and analyzing their data. I worked with a team to help perform research on how to bring their new feature of creating a centralized databank to life. This feature will allow their users to make more informed decisions on future investments and partnerships. My team and I benchmarked existing or similar technologies on how to handle big data, researched scalable algorithms to validate data and methods of protecting user anonymity. "
            }
        ],
        "programming": [{
                "name": "C++",
                "level": "85%"
            },
            {
                "name": "C",
                "level": "78%"
            },
            {
                "name": "Python",
                "level": "72%"
            },
            {
                "name": "JavaScript",
                "level": "70%"
            }
        ],
        "web": [{
                "name": "ReactJs",
                "level": "70%"
            },
            {
                "name": "NodeJs",
                "level": "70%"
            },
            {
                "name": "HTML, CSS, Bootstrap",
                "level": "80%"
            }
        ],
        "other": [{
                "name": "GIT",
                "level": "78%"
            },
            {
                "name": "MongoDB",
                "level": "55%"
            }
        ]
    },
    "portfolio": {
        "projects": [{
                "title": "Open Street Maps GIS",
                "category": "A worldwide GIS developed from scratch using C++ and geographical data from Open Street Maps.",
                "image": "OSMGIS.png",
                "url": "https://github.com/Edwinz28/Open-Street-Maps-GIS"
            },
            {
                "title": "Traveling Salesman Competition",
                "category": "A competition among all ECE students to design the best solution to the traveling salesman pickup/dropoff problem.",
                "image": "tsp.jpg",
                "url": "https://github.com/Edwinz28/TSPPD"
            },
            {
                "title": "My Personal Website",
                "category": "This site is open source! Developed using ReactJS",
                "image": "webpage.PNG",
                "url": "https://github.com/Edwinz28/My-Site"
            },
            {
                "title": "Auto Job Application Tracker",
                "category": "A webscraping tool that will automatically create a excel spreadsheet of your job applications. Developed using Python and BS4",
                "image": "autoapp.PNG",
                "url": "https://github.com/Edwinz28/Auto-Job-Application-Tracker"
            }

        ]
    },
    "testimonials": {
        "testimonials": [{
            "text": "Edwin's research and reports are now being used by my programming team to implement a solution he came up with. He impressed me with how fast he was able to learn about the affiliate marketing industry that I work in and it was important for him to understand it to be able to work on the project. Edwin took a lot of initiative in the team as he wasn't shy to ask questions. He had just as much initiative and ideas when coming up with solutions on the spot within our team meetings.",
            "user": "John Wright - Cofounder of StatsDrone"
        }]
    }
}