{
    "main": {
        "name": "Edwin Zhang",
        "bio": "My degree in computer engineering specializes in software development. Additionally I love 'next-gen' technology so I also plan on minoring in Artificial Intellegience and Machine Learning. I have experience working with C++, Python and Javascript which you can find out more in detail down below or download a condensed version in my resume!",
        "resumedownload": "EdwinZhangResume.pdf",
        "social": [{
                "name": "email",
                "url": "mailto:Edwin.Zhang28@gmail.com",
                "className": "fa fa-envelope"
            },
            {
                "name": "linkedin",
                "url": "https://www.linkedin.com/in/edwin-zhang-634734183/",
                "className": "fa fa-linkedin"
            },
            {
                "name": "instagram",
                "url": "https://www.instagram.com/edwinz_28/",
                "className": "fa fa-instagram"
            },
            {
                "name": "github",
                "url": "https://github.com/Edwinz28",
                "className": "fa fa-github"
            }
        ]
    },
    "resume": {
        "education": [{
            "school": "University of Toronto St. George",
            "degree": "Candidate for Bachelors in Computer Engineering",
            "graduated": "April 2022",
            "description": "Had a wonderful experience at this school so far! My learning has been diverse from learning about circuits to analog/digital electronics, computer hardware, and my favourite: software development. I've had the opportunity to work on many cool projects and design courses with my peers and even some professionals. Additionally, I'm looking forwards to my third year as I will be taking really interesting software and machine learning courses."
        }],
        "work": [{
                "company": "Major Tonic",
                "title": "Full Stack Developer",
                "years": "June 2010 - Present",
                "description": "Major Tonic is a Toronto based clothing startup looking to enter the fashion industry. My role on the team is to develop their online platform in form of a website to advertise and sell their products to their customers. I used react to turn their design of a website into reality as well as using MongoDB Atlas and NodeJS to create a drop shipping system. I've implemented their payment system as well as their user management system."
            },
            {
                "company": "StatsDrone",
                "title": "Research and Design Engineer",
                "years": "January 2019 - April 2019",
                "description": "StatsDrone offers a software to affiliate marketers that assists in amalgamating and analyzing their data. I worked with a team to help perform research on how to bring their new feature of creating a centralized databank to life. This feature will allow their users to make more informed decisions on future investments and partnerships. My team and I benchmarked existing or similar technologies on how to handle big data, researched scalable algorithms to validate data and methods of protecting user anonymity. "
            }
        ],
        "programming": [{
                "name": "C++",
                "level": "90%"
            },
            {
                "name": "C",
                "level": "82%"
            },
            {
                "name": "Python",
                "level": "75%"
            },
            {
                "name": "JavaScript",
                "level": "70%"
            }
        ],
        "web": [{
                "name": "ReactJs",
                "level": "70%"
            },
            {
                "name": "NodeJs",
                "level": "70%"
            },
            {
                "name": "HTML",
                "level": "95%"
            },
            {
                "name": "CSS/BootStrap",
                "level": "72%"
            }
        ],
        "other": [{
                "name": "GIT",
                "level": "78%"
            },
            {
                "name": "MongoDB",
                "level": "65%"
            },
            {
                "name": "Verilog",
                "level": "60%"
            }
        ]
    },
    "portfolio": {
        "projects": [{
                "title": "Canadian Wanderlust",
                "category": "My Travel Blog for my post-university travels",
                "image": "canadian-wanderlust.jpg",
                "url": "https://www.canadianwanderlust.com"
            },
            {
                "title": "Fury Fighting Gear",
                "category": "(offline now) A fighting gear company I started",
                "image": "fury-fighting-gear.jpg",
                "url": "http://www.timbakerdev.com"
            },
            {
                "title": "Original Thai Food",
                "category": "Website I built for a restaurant I like in Thailand",
                "image": "original-thai-food.jpg",
                "url": "http://www.timbakerdev.com/originalthaifood.github.io"
            },
            {
                "title": "Resume Website",
                "category": "A React based resume website template",
                "image": "resume-website.jpg",
                "url": "http://www.timbakerdev.com"
            },
            {
                "title": "Smirkspace",
                "category": "(MVP Only) A React and Meteor based chat University project.",
                "image": "smirkspace.jpg",
                "url": "http://www.smirkspace.com"
            }
        ]
    },
    "testimonials": {
        "testimonials": [{
            "text": "I've had the pleasure of working with Edwin through the Engineering Strategies & Practice (ESP) this year. Edwin was one of the leaders for a group that worked on a complex data survey to work with my data software tool for webmasters. The team in particular was given 4 to 5 projects that I gave and without hesitation they all chose the hardest project and the one I hoped they could make progress on.\n\nTheir research and reports are now being used by my programming team to implement a solution they came up with. The team impressed me with how fast they were able to learn about the affiliate marketing industry that I work in and it was important for them to understand it to be able to work on the project.\n\nEdwin took a lot of initiative in the group as he wasn't shy to ask questions. He had just as much initiative and ideas when coming up with solutions on the spot within our team meetings\n\nI am ecstatic I had this group of students to work with and Edwin in particular brought a lot of ideas and solutions that lead the group in the right direction. The team's work will accelerate this data survey project and Edwin did an amazing job!",
            "user": "John Wright - Cofounder of StatsDrone"
        }]
    }
}